<script lang="ts">
    import Container from "$components/Container.svelte";
</script>

<Container>
    <h1>ap12's ToolBox プライバシーポリシー</h1>
    <hr />
    <p>収集するデータについて</p>
    <span>
        このサービスではリクエストの時刻とパス及びメソッドのみをログとして保存をします<br />
        送信されたデータの内容に関しては収集・保存しません。<br /><br />
        また、このサービスの多くはクライアント側で処理され、サーバーへのデータ送信を行いません。<br />
        サーバーとの通信が技術的な理由により必要な機能は以下の通りです。
        <ul>
            <li>全てのネットワークツール</li>
            <li>MCサーバーステータス</li>
            <li>画像形式変換</li>
        </ul>
    </span>
    <p>データの利用目的</p>
    <span>
        1. サービスの品質向上のために利用解析に使用します<br />
        2. 攻撃の調査の際に使用します。
    </span>
    <p>収集した情報の削除について</p>
    <span> ユーザーから情報の削除を請求された場合、速やかに収集したデータの削除を行います </span>
    <p>SSLについて</p>
    <span>
        SSLに対応しており、WebブラウザとWebサーバーとの通信を暗号化しています。<br />
        ユーザーが入力したデータは自動的に暗号化され、送信されます。
    </span>
    <div>
        <p class="gray">2025/02/20 改定</p>
    </div>
</Container>

<style>
    .gray {
        color: #bbb;
    }
</style>
