<script>
    import Container from "$components/Container.svelte";
</script>

<Container>
    <h1>ap12's ToolBox 利用規約</h1>
    <hr />
    <ol>
        <li>サービスの設備を介して、当サービスや第三者等が提供するサービスなどの運営を妨害する行為または、これを試みる行為。</li>
        <li>サービス設備（ネットワーク設備・サーバ設備）等に故意過失問わず不必要な負荷を掛け、サービス提供に支障をきたす行為。</li>
        <li>IP通信網サービスで利用し情報を改ざん、またはそのおそれのある行為。</li>
        <li>本サービスに対し有害なコンピュータープログラムを含む情報を送信する行為などの行為</li>
        <li>本サービスに対し不正アクセスを行うもしくは、これを試みる行為。</li>
        <li>日本が定めている法律に違反する行為。</li>
        <li>事前の許諾なく、当サービスを再販する行為。</li>
        <li>プログラムのバグや不具合脆弱性等を不正に利用または悪用する行為。</li>
        <li>その他、ap12が不適切と判断する行為。</li>
    </ol>
</Container>
